app/views/repair_requests/_form.html.erb

    <%= f.label :submitter_id %><br />
    <%= f.collection_select :submitter_id, User.all.collect, :id, :username, :prompt => "Select a Unit" %>
---
SELECT "users".* FROM "users"