app/views/users/_form.html.erb

SELECT 1 FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" IS NULL AND "roles"."id" = 1 LIMIT 1
---
      <div>
      	<%= check_box_tag "user[role_ids][]", role.id, @user.roles.include?(role) %>

SELECT "leases".* FROM "leases"
SELECT "units".* FROM "units" WHERE "units"."id" = 1 LIMIT 1
---
    <%= f.label :lease_id %><br />
    <%= f.select :lease_id, Lease.all.collect {|x| [x.unit.name, x.id]}, {:prompt => "Select a property"}, {:id => "sltProperty"} %>