app/views/users/show.html.erb

  <ul>
  	<% @user.roles.each do |r| %>
---
SELECT "roles".* FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" = 1