app/views/properties/index.html.erb

SELECT "units".* FROM "units" WHERE "units"."property_id" = 1
---
    <td><%= property.zip %></td>
    <td><% property.units.each do |c| %>