app/views/properties/show.html.erb

SELECT "units".* FROM "units" WHERE "units"."property_id" = 1
---
  <b>Units:</b>
  <% @property.units.each do |c| %>