app/views/leases/_form.html.erb

SELECT "units".* FROM "units"
---
    <%= f.label :unit_id %><br />
    <%= f.collection_select :unit_id, Unit.all.collect, :id, :name, :prompt => "Select a Unit" %>