app/views/units/_form.html.erb

SELECT "properties".* FROM "properties"
---
    <%= f.label :property %><br />
    <%= f.collection_select :property_id, Property.all.collect, :id, :name, :prompt => "Select a property" %>