app/controllers/leases_controller.rb

  def index
    @leases = Lease.all
---
SELECT "leases".* FROM "leases" WHERE (3 IN leases.renters)

  def show
    @lease = Lease.find(params[:id])
---
SELECT "leases".* FROM "leases" WHERE "leases"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @lease = Lease.find(params[:id])
---
SELECT "leases".* FROM "leases" WHERE "leases"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @lease = Lease.new(params[:lease])

    respond_to do |format|
      if @lease.save
---
INSERT INTO "leases" ("created_at", "end_date", "rent", "start_date", "unit_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @lease = Lease.find(params[:id])

    respond_to do |format|
      if @lease.update_attributes(params[:lease])
---
SELECT "leases".* FROM "leases" WHERE "leases"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "leases" SET "rent" = 599, "updated_at" = '2013-02-20 02:56:20.835022' WHERE "leases"."id" = 1