app/controllers/payments_controller.rb

  def index
    @payments = Payment.all
    @approved_payments = Payment.where(:user_id => current_user)
---
SELECT "payments".* FROM "payments"
SELECT "payments".* FROM "payments" WHERE "payments"."user_id" IS NULL

  def show
    @payment = Payment.find(params[:id])
---
SELECT "payments".* FROM "payments" WHERE "payments"."id" = ? LIMIT 1  [["id", "15"]]

  def create
    @payment = Payment.new(params[:payment])
    @payment.ip_address = request.remote_ip
    @payment.user = current_user
    @payment.lease = current_user.lease

    respond_to do |format|
      if @payment.save
        if @payment.make_transaction
          format.html { redirect_to @payment, notice: 'Payment was successfully created.' }
          format.json { render json: @payment, status: :created, location: @payment }
        else
          @payment.destroy
---
INSERT INTO "payments" ("amount", "card_expires_on", "created_at", "first_name", "ip_address", "last_name", "lease_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
DELETE FROM "payments" WHERE "payments"."id" = ?  [["id", 4]]