app/controllers/properties_controller.rb

  def index
    @properties = Property.all
---
SELECT "properties".* FROM "properties"

  def show
    @property = Property.find(params[:id])
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @property = Property.find(params[:id])
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @property = Property.new(params[:property])

    respond_to do |format|
      if @property.save
---
INSERT INTO "properties" ("address", "city", "created_at", "name", "state", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?)