app/controllers/repair_requests_controller.rb

  def index
    @repair_requests = RepairRequest.all
    @approved_requests = RepairRequest.where(:submitter_id => current_user)
---
SELECT "repair_requests".* FROM "repair_requests"
SELECT "repair_requests".* FROM "repair_requests" WHERE "repair_requests"."submitter_id" IS NULL

  def show
    @repair_request = RepairRequest.find(params[:id])
---
SELECT "repair_requests".* FROM "repair_requests" WHERE "repair_requests"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @repair_request = RepairRequest.find(params[:id])
---
SELECT "repair_requests".* FROM "repair_requests" WHERE "repair_requests"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @repair_request = RepairRequest.new(params[:repair_request])
    @repair_request.submitter = current_user
     if current_user.has_role? :manager
       @repair_request.responder = current_user
     end

    respond_to do |format|
      if @repair_request.save
---
INSERT INTO "repair_requests" ("close_date", "created_at", "open_date", "request_details", "request_response", "responder_id", "submitter_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @repair_request = RepairRequest.find(params[:id])
    if current_user.has_role? :renter
      @repair_request.submitter = current_user
    elsif current_user.has_role? :manager
      @repair_request.responder = current_user
    end

    respond_to do |format|
      if @repair_request.update_attributes(params[:repair_request])
---
SELECT "repair_requests".* FROM "repair_requests" WHERE "repair_requests"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "repair_requests" SET "request_response" = 'Replaced blinds.', "close_date" = '2013-02-27', "updated_at" = '2013-02-27 08:20:36.823500' WHERE "repair_requests"."id" = 3