app/controllers/units_controller.rb

SELECT "units".* FROM "units"
---
  def index
    @units = Unit.all

SELECT "units".* FROM "units" WHERE "units"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @unit = Unit.find(params[:id])

SELECT "units".* FROM "units" WHERE "units"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @unit = Unit.find(params[:id])

INSERT INTO "units" ("created_at", "name", "property_id", "square_feet", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 18 Feb 2013 04:15:44 UTC +00:00], ["name", "Apt A1"], ["property_id", nil], ["square_feet", 750], ["updated_at", Mon, 18 Feb 2013 04:15:44 UTC +00:00]]
---
  def create
    @unit = Unit.new(params[:unit])

    respond_to do |format|
      if @unit.save

SELECT "units".* FROM "units" WHERE "units"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @unit = Unit.find(params[:id])

SELECT "units".* FROM "units" WHERE "units"."id" = ? LIMIT 1  [["id", "1"]]
---
  def destroy
    @unit = Unit.find(params[:id])