app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "email", "lease_id", "password_salt", "persistence_token", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save